# common
brew "make"
brew "git"
brew "gnu-sed"
brew "grep"
brew "wget"
brew "telnet"
brew "tree"
brew "jq"
brew "tmux"
brew "fd"

# sh
brew "zsh"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
# brew "zsh-fast-syntax-highlighting"
# TODO
# brew "zsh-history-substring-search"
# brew "zsh-async"
# brew "zsh-nvm"
# brew "zsh-vi-mode"
# brew "zsh-256color"
# brew "zsh-vi-mode"
brew "starship"
cask "font-hack-nerd-font"

# infra
# brew "tfnotify"
# brew "tfrun"

cask "docker"
cask "google-chrome"
cask "firefox"
cask "visual-studio-code@insiders"
cask "cursor"
cask "windsurf"
cask "iterm2"
cask "warp"
cask "notion"
cask "1password"
cask "zoom"
cask "the-unarchiver"
cask "clipy"
cask "xcodes"
cask "slack"
cask "discord"
cask "microsoft-teams"
cask "onedrive"
cask "chatgpt"
cask "claude"
mas "Perplexity", id: 6714467650
cask "microsoft-edge"
cask "microsoft-word"
cask "libreoffice"
cask "adobe-acrobat-reader"
cask "beekeeper-studio"
cask "slack-cli"

# private
cask "kindle"
mas "LINE", id: 539883307
