# common
brew "peco"
brew "make"
brew "just"
brew "vim"
brew "dasel"
brew "gnu-sed"
brew "grep"
brew "wget"

# zsh
brew "zsh"
brew "zsh-completions"

# manager
brew "anyenv" # TODO: delete
brew "pipx" # TODO: delete
brew "mise"

# js
brew "biome"
brew "deno"

# formated data
brew "jq"
brew "yq"
brew "jsonnet"

# git
brew "ghq"
brew "git"
brew "gh"
brew "git-trim"
brew "actionlint"

# infra
brew "awscli"
brew "azure-cli"
brew "cfn-lint"
brew "aws-sam-cli"
# TODO terraformは？
brew "terragrunt"
brew "terraform-docs"
brew "tflint"
brew "tfsec"
# brew "tfnotify"
# brew "tfrun"
# brew "terraform-ls"

# db
brew "mysql-client"
brew "libpq", link: true
brew "sqlite3"

# other
brew "rustup"
brew "pnpm"
brew "hadolint"

cask "docker"
cask "google-chrome"
cask "iterm2"
cask "slack"
cask "notion"
cask "visual-studio-code"
cask "visual-studio-code@insiders"
cask "microsoft-teams"
cask "1password"
cask "google-cloud-sdk"
cask "zoom"
cask "the-unarchiver"
cask "xcodes"
cask "slack-cli"
cask "clipy"
cask "firefox"
cask "microsoft-edge"
cask "microsoft-word"
cask "cursor"
cask "onedrive"
cask "chatgpt"
cask "libreoffice"
cask "adobe-acrobat-reader"

brew "brew-gem"
gem "cfn-nag" # 動いていない

# dotnet
tap "isen-ng/dotnet-sdk-versions"
cask "dotnet-sdk8"

# whalebrew

# TODO
#tag "sqldef/sqldef/psqldef"

mas "Perplexity", id: 6714467650
# vscode
vscode "alefragnani.bookmarks"
vscode "aws-scripting-guy.cform"
vscode "biomejs.biome"
vscode "boto3typed.boto3-ide"
vscode "charliermarsh.ruff"
vscode "denoland.vscode-deno"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hbenl.vscode-test-explorer"
vscode "kddejong.vscode-cfn-lint"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "zainchen.json"

# private
cask "kindle"
mas "LINE", id: 539883307
