# common
brew "make"
brew "git"
brew "gnu-sed"
brew "grep"
brew "wget"
brew "telnet"
brew "tree"
brew "jq"

# zsh
brew "zsh"
brew "zsh-completions"

# infra
# brew "tfnotify"
# brew "tfrun"

# db
brew "mysql-client"
brew "libpq", link: true
brew "sqlite3"

cask "docker"
cask "google-chrome"
cask "iterm2"
cask "slack"
cask "notion"
cask "visual-studio-code"
cask "visual-studio-code@insiders"
cask "microsoft-teams"
cask "1password"
cask "zoom"
cask "the-unarchiver"
cask "xcodes"
cask "slack-cli"
cask "clipy"
cask "firefox"
cask "microsoft-edge"
cask "microsoft-word"
cask "cursor"
cask "onedrive"
cask "chatgpt"
cask "libreoffice"
cask "adobe-acrobat-reader"

# whalebrew

mas "Perplexity", id: 6714467650

# private
cask "kindle"
mas "LINE", id: 539883307
