cask "google-chrome"
cask "firefox"
cask "microsoft-edge"
cask "visual-studio-code"
cask "cursor"
cask "iterm2"
cask "warp"
cask "notion"
cask "figma"
cask "1password"
cask "zoom"
cask "the-unarchiver"
cask "clipy"
cask "xcodes"
cask "slack"
cask "discord"
cask "microsoft-teams"
cask "onedrive"
cask "chatgpt"
cask "claude"
cask "kiro"
mas "Perplexity", id: 6714467650
cask "microsoft-word"
cask "libreoffice"
cask "adobe-acrobat-reader"
cask "beekeeper-studio"
cask "obsidian"
mas "LINE", id: 539883307
mas "Kindle", id: 302584613
